app/controllers/buildings_controller.rb

SELECT "buildings".* FROM "buildings" WHERE (name LIKE '%germany%' OR address LIKE '%germany%' OR neighborhood LIKE '%germany%' OR city LIKE '%germany%' OR country LIKE '%germany%')
SELECT "buildings".* FROM "buildings"
---
  def index
    if params[:search]
      @buildings = Building.where("name LIKE ? OR address LIKE ? OR neighborhood LIKE ? OR city LIKE ? OR country LIKE ? OR description LIKE ?", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%")
    else
      @buildings = Building.all

SELECT "buildings".* FROM "buildings" WHERE (name LIKE '%%' OR address LIKE '%%' OR neighborhood LIKE '%%' OR city LIKE '%%' OR country LIKE '%%' OR description LIKE '%%')
---
  def search
    @buildings = Building.where("name LIKE ? OR address LIKE ? OR neighborhood LIKE ? OR city LIKE ? OR country LIKE ? OR description LIKE ?", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%")

SELECT "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @building = Building.find(params[:id])

INSERT INTO "buildings" ("name", "address", "latitude", "longitude", "neighborhood", "city", "country", "created_at", "updated_at", "image", "average_rating") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @building = Building.new(building_params)

    respond_to do |format|
      if @building.save

UPDATE "buildings" SET "updated_at" = ?, "description" = ? WHERE "buildings"."id" = ?  [["updated_at", "2023-05-23 21:25:08.970128"], ["description", "test"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @building.update(building_params)

SELECT "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_building
      @building = Building.find(params[:id])