app/controllers/registers_controller.rb

  def index
    @registers = Register.all
---
SELECT "registers".* FROM "registers" WHERE (cdgpdf LIKE '%0002%' OR ref LIKE '%0002%' OR autorcargo LIKE '%0002%' OR destinatariocargo LIKE '%0002%' OR titulo LIKE '%0002%' OR local LIKE '%0002%')